"""
рефлексия:

Задание 10, задача 4: основной алгоритм реализовал верно, но забыл учесть случай, когда одно из множеств
пустое. Про обобщение на произвольное кол-во множеств через рекурсию - красиво, пришлось напрячься,
чтобы представить в голове этот алгоритм.

Задание 10, задача 6: задание выполнил верно, только не добавил метод для получения частоты эл-та.

Задание 11, задача 2: перепутал И с ИЛИ. Глупая ошибка :(

Задание 11, задача 3: верно применил идею со счётчиками. Не знал, что у таких фильтров Блюма есть 
отдельное название.

Задание 11, задача 4: ну да, как будто без метода грубой силы и анализа предметной области не обойтись.
"""

